app/Controllers/Pages.php

  function view($page = 'home')
  {

    $FaqModel = new FaqModel();
    $TestimonialModel = new TestimonialModel();
    $BasicModel = new BasicModel();
    $data = $this->site;

    //FAQs
    $data['faqs'] = $FaqModel->orderBy('id', 'ASC')->findAll();
    //Testimonials
    $data['testimonials'] = $TestimonialModel->orderBy('id', 'ASC')->findAll();
    //Terms and Conditions
    $data['terms'] = $BasicModel->where('title', 'terms')->first()['value'];
    //About Us
    $data['about_us'] = $BasicModel->where('title', 'about')->first()['value'];
---
SELECT *
FROM `ci_faqs`
ORDER BY `id` ASC
SELECT *
FROM `ci_testimonials`
ORDER BY `id` ASC
SELECT *
FROM `ci_basic`
WHERE `title` = 'terms'
 LIMIT 1
SELECT *
FROM `ci_basic`
WHERE `title` = 'about'
 LIMIT 1