Main php app/app/Controllers/Admin.php

SELECT *
FROM `ci_admin`
WHERE `admin_username` = 'pandashoki'
 LIMIT 1
---
  protected function admin()
  {
    if (!session()->get("admin")) {
      return redirect()->to("auth/admin?url=" . current_url());
    } else {
      $username = session()->get("admin");
      $Model = new AdminModel();
      $ticketModel = new SupportModel();
      $UserModel = new UserModel();
      $admin = $Model->where("admin_username", $username)->first();

SELECT *
FROM `ci_basic`
WHERE `title` = 'about'
 LIMIT 1
---
  public function about()
  {
    $site = $this->site;
    $admin = $this->admin();
    $Model = new BasicModel();
    $site["page"] = 'About Us';

    if (!session()->get("admin")) {
      if ($this->request->getGet("id")) {
        $param = '?' . $_SERVER['QUERY_STRING'];
      } else {
        $param = '';
      }
      return redirect()->to("auth/admin?url=" . current_url() . $param);
    } else if ($admin['role'] == 1) {



      if ($this->request->getPost('update')) {

        $Model->where("title", "about")->set("value", $this->request->getPost("about"))->update();
        session()->setFlashdata("msg", 'About Us Updated');
        return redirect()->to("admin/about");
      } else {

        $row = $Model->where("title", "about")->first();